Tekla Open API Reference for Tekla Structures 2025
PlacingQuarterAttributes Class
 The PlacingQuarterAttributes class contains the basic attributes for placing quarters.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.PlacingQuarterAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class PlacingQuarterAttributes : GenericAttributesBase,
	ICloneable
<SerializableAttribute>
Public NotInheritable Class PlacingQuarterAttributes
	Inherits GenericAttributesBase
	Implements ICloneable
The PlacingQuarterAttributes type exposes the following members.
Constructors
Name | Description
PlacingQuarterAttributes()
 Creates a new placing quarter attributes instance. The default parameters are: TopLeft = true, TopRight = true, BottomLeft = true, BottomRight = true.
PlacingQuarterAttributes(Boolean, Boolean, Boolean, Boolean)
 Creates a new placing quarter attributes instance with the given parameters.
Top
Properties
Name | Description
BottomLeft
 Defines whether the object can search for a suitable location in the bottom left direction.
BottomRight
 Defines whether the object can search for a suitable location in the bottom right direction.
TopLeft
 Defines whether the object can search for a suitable location in the top left direction.
TopRight
 Defines whether the object can search for a suitable location in the top right direction.
Top
Methods
Name | Description
Clone
 Creates a new object that is a copy of the current instance.
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace